# -*- coding: UTF-8 -*-
'''
本章主要介绍语句和语法

1.类C语言中需要哪三项在Python中省略了的语法成分？
---类C语言需要在一些语句中的测试两侧使用圆括号，需要在每个语句末尾有分号，以及嵌套代码块周围有大括号。

2.Python中的语句一般是怎样终止的？
---一行的结尾就是该行语句的终止。
此外，如果一个以上的语句出现在同行上，可以使用分号终止；
同样地，如果一个语句跨过数行，可以用语法上的闭合括号终止这一行。

3.在Python中，嵌套代码块内的语句一般是如何关联在一起的？
---嵌套代码块中的语句都得缩进相同数目的制表符或空格。

4.你怎么让一条语句跨过多行？
---语句可以横跨多行，只要将其封闭在圆括号内、方括号内或大括号内即可。
当Python遇到一行含有一对括号中的闭合括号，语句就会结束。

5.你怎么在单个行上编写复合语句？
---复合语句的主体可以移到开头行的冒号后面，但前提是主体只由非复合语句构成。

6.有什么理由要在Python语句末尾输入分号呢？
---只有当你需要把一列以上的语句挤进一行代码时。
即使是这种情况下，也只有当所有语句都是非复合时，才行得通，此外因为这样会让程序代码难以阅读，所以不建议这么做。

7.try语句是用来做什么的？
---try语句是用于在Python脚本中捕捉和恢复异常（错误）的。这通常是程序中自行检查错误的方法之一。

8.Python初学者最常犯的编写代码错误是什么？
---忘记在复合语句开头行末尾输入冒号，是初学者最常犯的错误。如果你还没有犯过这样的错误，你可能很快会犯。
'''

if __name__ == '__main__':
    pass
